## Importacion de librerias

In [1]:
#Importing libraries
import pandas as pd
import numpy as np
from datetime import datetime as dt
from datetime import timedelta as td
import matplotlib.pyplot as pl
import seaborn as sns
%matplotlib inline

## Leer datos

In [2]:
#Import data titanic
titanic = pd.read_csv("../01. Flat Files/titanic.csv",delimiter=",")
titanic.head(5)

,Passenger Class,Name,Sex,Age,No of Siblings or Spouses on Board,No of Parents or Children on Board,Ticket Number,Passenger Fare,Cabin,Port of Embarkation,Life Boat,Survived
0,First,"Allen, Miss. Elisabeth Walton",Female,29.0,0.0,0.0,24160,211.3,B5,Southampton,2,Yes
1,First,"Allison, Master. Hudson Trevor",Male,0.9,1.0,2.0,113781,151.6,C22 C26,Southampton,11,Yes
2,First,"Allison, Miss. Helen Loraine",Female,2.0,1.0,2.0,113781,151.6,C22 C26,Southampton,NaN,No
3,First,"Allison, Mr. Hudson Joshua Creighton",Male,30.0,1.0,2.0,113781,151.6,C22 C26,Southampton,NaN,No
4,First,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",Female,25.0,1.0,2.0,113781,151.6,C22 C26,Southampton,NaN,No

# ETL Titanic

## Arreglo columna Age

In [3]:
#Definicion de funcion para calcular la media de la columna age
def addAge (cols):
    age = cols[0]
    pclass = cols[1]
    
    if pd.isnull(age):
        return int(titanic[titanic["Passenger Class"] == pclass]["Age"].mean())
    else:
        return age

In [4]:
#Cantidad de registros nulos por columna en la tabla
null_columns = titanic.columns[titanic.isnull().any()]
print(titanic[null_columns].isnull().sum())
print("")

del null_columns

#Aplica sobre la columna age la funcion add_age
titanic["Age"] = titanic[["Age","Passenger Class"]].apply(addAge,axis=1) #Axis 1 para que lo aplique sobre la columna
  
#Cantidad de registros nulos por columna en la tabla
null_columns = titanic.columns[titanic.isnull().any()]
print(titanic[null_columns].isnull().sum())

del null_columns

Age                     263
Passenger Fare            1
Cabin                  1014
Port of Embarkation       2
Life Boat               823
dtype: int64

Passenger Fare            1
Cabin                  1014
Port of Embarkation       2
Life Boat               823
dtype: int64

## Eliminar columnas de Cabin y Life Boat

In [5]:
#Cantidad de registros nulos por columna en la tabla
null_columns = titanic.columns[titanic.isnull().any()]
print(titanic[null_columns].isnull().sum())
print("")

del null_columns

#ELiminacion de las clumnas Cabin y Life Boat
titanic = titanic.drop(columns=["Cabin","Life Boat"])

#Cantidad de registros nulos por columna en la tabla
null_columns = titanic.columns[titanic.isnull().any()]
print(titanic[null_columns].isnull().sum())

del null_columns

Passenger Fare            1
Cabin                  1014
Port of Embarkation       2
Life Boat               823
dtype: int64

Passenger Fare         1
Port of Embarkation    2
dtype: int64

## Arreglo columnas de Passenger Fare y Port of Embarkation

In [6]:
#Cantidad de registros nulos por columna en la tabla
null_columns = titanic.columns[titanic.isnull().any()]
print(titanic[null_columns].isnull().sum())
print("")

del null_columns

#ELiminacion de las filas nulas en Passenger Fare y Port of Embarkation
titanic = titanic.dropna(axis="index", subset=["Passenger Fare","Port of Embarkation"])

#Cantidad de registros nulos por columna en la tabla
null_columns = titanic.columns[titanic.isnull().any()]
print(titanic[null_columns].isnull().sum())

del null_columns

Passenger Fare         1
Port of Embarkation    2
dtype: int64

Series([], dtype: float64)

## Convertir a nominal las columnas string (Cuando es posible)

In [7]:
#Se convierte la columna Sex en nominal
sex = pd.get_dummies(titanic["Sex"])
#Se convierte la columna Passenger Class en nominal
ps_class = pd.get_dummies(titanic["Passenger Class"])
#Se convierte la columna Port of Embarkation en nominal
embarkation = pd.get_dummies(titanic["Port of Embarkation"])

#Se hace la concactenacion de las columnas con concat 
titanic = pd.concat([titanic,sex,ps_class,embarkation],axis=1) #Axis 1 agrega las columnas 
titanic.head()

,Passenger Class,Name,Sex,Age,No of Siblings or Spouses on Board,No of Parents or Children on Board,Ticket Number,Passenger Fare,Port of Embarkation,Survived,Female,Male,First,Second,Third,Cherbourg,Queenstown,Southampton
0,First,"Allen, Miss. Elisabeth Walton",Female,29.0,0.0,0.0,24160,211.3,Southampton,Yes,1,0,1,0,0,0,0,1
1,First,"Allison, Master. Hudson Trevor",Male,0.9,1.0,2.0,113781,151.6,Southampton,Yes,0,1,1,0,0,0,0,1
2,First,"Allison, Miss. Helen Loraine",Female,2.0,1.0,2.0,113781,151.6,Southampton,No,1,0,1,0,0,0,0,1
3,First,"Allison, Mr. Hudson Joshua Creighton",Male,30.0,1.0,2.0,113781,151.6,Southampton,No,0,1,1,0,0,0,0,1
4,First,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",Female,25.0,1.0,2.0,113781,151.6,Southampton,No,1,0,1,0,0,0,0,1

## Creacion de copia independiente de Titanic

In [8]:
seaTitanic = titanic.copy()
seaTitanic.head()

,Passenger Class,Name,Sex,Age,No of Siblings or Spouses on Board,No of Parents or Children on Board,Ticket Number,Passenger Fare,Port of Embarkation,Survived,Female,Male,First,Second,Third,Cherbourg,Queenstown,Southampton
0,First,"Allen, Miss. Elisabeth Walton",Female,29.0,0.0,0.0,24160,211.3,Southampton,Yes,1,0,1,0,0,0,0,1
1,First,"Allison, Master. Hudson Trevor",Male,0.9,1.0,2.0,113781,151.6,Southampton,Yes,0,1,1,0,0,0,0,1
2,First,"Allison, Miss. Helen Loraine",Female,2.0,1.0,2.0,113781,151.6,Southampton,No,1,0,1,0,0,0,0,1
3,First,"Allison, Mr. Hudson Joshua Creighton",Male,30.0,1.0,2.0,113781,151.6,Southampton,No,0,1,1,0,0,0,0,1
4,First,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",Female,25.0,1.0,2.0,113781,151.6,Southampton,No,1,0,1,0,0,0,0,1

## Eliminacion de columnas que no son relevantes en el modelo

In [9]:
titanic = titanic.drop(columns = ["Passenger Class","Name","Sex","Ticket Number","Port of Embarkation","Passenger Fare"])
titanic.head()

,Age,No of Siblings or Spouses on Board,No of Parents or Children on Board,Survived,Female,Male,First,Second,Third,Cherbourg,Queenstown,Southampton
0,29.0,0.0,0.0,Yes,1,0,1,0,0,0,0,1
1,0.9,1.0,2.0,Yes,0,1,1,0,0,0,0,1
2,2.0,1.0,2.0,No,1,0,1,0,0,0,0,1
3,30.0,1.0,2.0,No,0,1,1,0,0,0,0,1
4,25.0,1.0,2.0,No,1,0,1,0,0,0,0,1

# Mineria de datos

## Proceso de entrenamiento

In [10]:
# Se deja una matriz con las columnas predictorias
x = titanic.drop(columns=["Survived"])

from sklearn.preprocessing import LabelEncoder 
#Se inicializa el LabelEncoder
enc = LabelEncoder()
#Se crea un diccionario para las transformaciones
diccionarioEncoder = {}
#Se realiza la codificacion
enc.fit(titanic["Survived"])
#Obtencion de la codificacion
diccionarioEncoder = enc.classes_
# Un arreglo con la columna predecida
y = enc.transform(titanic["Survived"])

In [11]:
#Importa la funcion train test split
from sklearn.model_selection import train_test_split

#Se obtienen 4 variables con la informacion necesaria para correr un modelo de prediccion, con la matriz de entrenamiento
xTrain, xTest, yTrain, yTest = train_test_split(x,y,test_size = 0.3, random_state = 101)

## Prediccion por Regresion Logistica

In [12]:
#Importa el el modelo de LogisticRegression
from sklearn.linear_model import LogisticRegression

logmodel = LogisticRegression(max_iter=1000)
logmodel.fit(xTrain,yTrain)

LogisticRegression(max_iter=1000)

In [13]:
from sklearn.ensemble import RandomForestClassifier
model = RandomForestClassifier(n_estimators=50, max_depth=5)
model.fit(xTrain, yTrain)

RandomForestClassifier(max_depth=5, n_estimators=50)

In [18]:
from explainerdashboard import ClassifierExplainer, ExplainerDashboard
explainer = ClassifierExplainer(model, xTest, yTest, cats=x.columns.values, labels=diccionarioEncoder.tolist())
ExplainerDashboard(explainer, mode='jupyterlab').run()

Detected RandomForestClassifier model: Changing class type to RandomForestClassifierExplainer...
Note: model_output=='probability', so assuming that raw shap output of RandomForestClassifier is in probability space...
Generating self.shap_explainer = shap.TreeExplainer(model)
Building ExplainerDashboard..
Warning: calculating shap interaction values can be slow! Pass shap_interaction=False to remove interactions tab.
Generating layout...
Calculating shap values...
Calculating dependencies...
Calculating permutation importances (if slow, try setting n_jobs parameter)...
Calculating predictions...
Calculating roc auc curves...
Calculating prediction probabilities...
Calculating liftcurve_dfs...
Calculating pred_percentiles...
Calculating confusion matrices...
Calculating classification_dfs...
Calculating pr auc curves...
Calculating metrics...
Calculating shap interaction values... (this may take a while)
Reminder: TreeShap computational complexity is O(TLD^2), where T is the number of trees, L is the maximum number of leaves in any tree and D the maximal depth of any tree. So reducing these will speed up the calculation.
Calculating ShadowDecTree for each individual decision tree...
Reminder: you can store the explainer (including calculated dependencies) with explainer.dump('explainer.joblib') and reload with e.g. ClassifierExplainer.from_file('explainer.joblib')
Registering callbacks...
Starting ExplainerDashboard inline (terminate it with ExplainerDashboard.terminate(8050))

In [16]:
#Apply model
predictions = logmodel.predict(xTest)

from sklearn.metrics import classification_report

#Matriz de precision (accuracy)
print(classification_report(yTest,predictions))

              precision    recall  f1-score   support

           0       0.85      0.85      0.85       247
           1       0.74      0.74      0.74       145

    accuracy                           0.81       392
   macro avg       0.80      0.80      0.80       392
weighted avg       0.81      0.81      0.81       392